spotify/app/views/notes/new.html.erb

    <select name="note[track_id]">
    <% Track.all.each do |track| %>
---
SELECT "tracks".* FROM "tracks"