spotify/app/views/bands/show.html.erb

<h2>Albums</h2>
<% @band.albums.each do |album|%>
---
SELECT "albums".* FROM "albums" WHERE "albums"."band_id" = $1  [["band_id", 3]]