spotify/app/controllers/albums_controller.rb

    def create
        @album = Album.new(album_params)

        if @album.save
---
INSERT INTO "albums" ("band_id", "year", "title", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["band_id", 3], ["year", 2018], ["title", "Culture 2"], ["created_at", "2019-08-06 21:26:52.205135"], ["updated_at", "2019-08-06 21:26:52.205135"]]

    def show
        @album = Album.find(params[:id])
---
SELECT  "albums".* FROM "albums" WHERE "albums"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]