spotify/app/controllers/bands_controller.rb

INSERT INTO "bands" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "Migos"], ["created_at", "2019-08-06 20:34:13.820641"], ["updated_at", "2019-08-06 20:34:13.820641"]]
---
    def create
        @band = Band.new(band_params)

        if @band.save

SELECT  "bands".* FROM "bands" WHERE "bands"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def show
        @band = Band.find(params[:id])

SELECT "bands".* FROM "bands"
---
    def index
        @bands = Band.all

SELECT  "bands".* FROM "bands" WHERE "bands"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
DELETE FROM "bands" WHERE "bands"."id" = $1  [["id", 2]]
---
    def destroy
        @band = Band.find(params[:id])
        if @band
            @band.destroy

SELECT  "bands".* FROM "bands" WHERE "bands"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
---
    def edit
        @band = Band.find(params[:id])

SELECT  "bands".* FROM "bands" WHERE "bands"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
UPDATE "bands" SET "name" = $1, "updated_at" = $2 WHERE "bands"."id" = $3  [["name", "Migos2"], ["updated_at", "2019-08-06 20:44:40.570288"], ["id", 3]]
---
    def update
        @band = Band.find(params[:id])

        @band.update(band_params)