spotify/app/controllers/notes_controller.rb

    def create
        @note = Note.new(note_params)
        @note.user_id = current_user.id

        if @note.save
---
INSERT INTO "notes" ("user_id", "track_id", "note", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["user_id", 1], ["track_id", 4], ["note", "Sweet Song"], ["created_at", "2019-08-06 23:19:06.524306"], ["updated_at", "2019-08-06 23:19:06.524306"]]

    def destroy
        @note = Note.find(params[:id])

        if @note
         @note.destroy
---
SELECT  "notes".* FROM "notes" WHERE "notes"."id" = $1 LIMIT $2  [["id", 8], ["LIMIT", 1]]
DELETE FROM "notes" WHERE "notes"."id" = $1  [["id", 8]]