spotify/app/controllers/tracks_controller.rb

    def create
      @track = Track.new(track_params)

        if @track.save
---
INSERT INTO "tracks" ("title", "ord", "album_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "YRN"], ["ord", 4], ["album_id", 3], ["created_at", "2019-08-06 22:26:38.229898"], ["updated_at", "2019-08-06 22:26:38.229898"]]

    def show
        @track = Track.find(params[:id])
---
SELECT  "tracks".* FROM "tracks" WHERE "tracks"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]