spotify/app/views/albums/show.html.erb

SELECT "tracks".* FROM "tracks" WHERE "tracks"."album_id" = $1  [["album_id", 3]]
---
<h2>Albums</h2>
<% @album.tracks.each do |track|%>