spotify/app/views/tracks/show.html.erb

<h2></h2>
<% @track.notes.each do |note|%>
---
SELECT "notes".* FROM "notes" WHERE "notes"."track_id" = $1  [["track_id", 4]]